{
  "timestamp": "2025-11-10T14:18:02.604Z",
  "resumeFile": "PRAVIN PATIL .pdf.pdf",
  "textLength": 7102,
  "datesFoundInText": [
    "Dec 2023",
    "Feb 2025"
  ],
  "extractedText": "\n\nPRAVIN PATIL\nCOMPUTER ENGINEER | FULL STACK DEVELOPER\nSUMMARY\nPROJECTS\nWORK EXPERIENCE\nFrontend Developer with strong full-stack expertise, skilled in HTML, CSS, JavaScript, XML, and React for\nbuilding responsive, user-centric interfaces. As a MERN Stack Developer, I specialize in creating dynamic and\nscalable web applications using MongoDB, Express.js, React, and Node.js. I bring a deep understanding of both\nclient-side and server-side development, including API design, database management, and real-time web features.\nPassionate about integrating AI-driven technologies into modern web solutions.Experienced in working with AI\nAPIs (e.g., chat, recommendation engines, NLP) and building intelligent user experiences that adapt and learn.\nEager to contribute to teams building the next generation of AI-enabled platforms.\nCurrently expanding expertise in Generative AI, focusing on Retrieval-Augmented Generation (RAG), LLM-\nbased applications, and Agentic AI architectures using frameworks like LangChain and Hugging Face.\nTrioNxt Software Private Ltd\nSoftware developer\nPrimary focus is on utilizing Angular framework.\nContribute to developing and maintaining robust.\nDesign and implement efficient back-end architectures, manage databases, and ensure seamless integration with\nfront-end components.\nContributed to parallel design sessions, creating design artifacts based on project specifications, and ensured that\nall components of the web application were platform and browser compatible.\nWeb application were platform and browser compatible\nSaraswati College of Engineering, Kharghar (University of Mumbai ) Graduated in 2023 \nEDUCATION\nBachelor of Engineering in Computer Engineering\nAiroli,Navi Mumbai | 9527141062 | pravinbpatilpp7@gmail.com \nPortfolio\nDec 2023 - Feb 2025\nTecheology Nerds Portfolio Platform\n Tech Stack: React, Node.js, MongoDB, Express, Tailwind CSS, Redis\nDeveloped a comprehensive full-stack portfolio platform showcasing professional services and projects\nBuilt responsive frontend using React 18, Vite, and Tailwind CSS with modern UI/UX design\nImplemented backend API using Node.js, Express.js, and MongoDB with Redis caching for performance optimization\nCreated admin dashboard with authentication, contact management, and review system\nIntegrated real-time features including job posting updates and dynamic content management\nDeployed frontend on Vercel and backend on Railway with CI/CD pipeline\nImplemented SEO optimization, structured data, and performance monitoring\n K-Store E-Commerce Platform\nTech Stack: React, Node.js, MongoDB, Express, Tailwind CSS\nDeveloped a modern e-commerce platform with responsive design and seamless shopping experience\nImplemented product catalog with search and filtering capabilities\nBuilt secure shopping cart and checkout process with payment integration\nCreated user authentication system and admin dashboard for product management\nIntegrated real-time inventory tracking and customer reviews system\nUbirt Travel Platform\n Tech Stack: React, Node.js, MongoDB, Express, AI Integration\nBuilt a comprehensive travel companion ecosystem with AI-powered matching\nImplemented real-time messaging, trip planning, and payment integration\nCreated user matching algorithms and social features for travelers\nDeveloped responsive design for mobile and desktop platforms\n\nTech Stack: React, Node.js, MongoDB, AI APIs, Community Features\nBuilt a comprehensive AI community platform with expert videos and tools\nImplemented social features for AI enthusiasts and professionals\nCreated content management system for blogs and educational resources\nIntegrated AI tools and community interaction features\nAI Community Platform\nTech Stack: Python, Flask, React, MongoDB, Machine Learning\n Developed and maintained a Mental Health Companion web application using the MERN stack\nImplemented a predictive model for mental state analysis using basic machine learning techniques\nUtilized Flask for the backend, React for the frontend, and MongoDB for data storage\nCreated user-friendly interface for mental health tracking and support\nMental Health Companion Project\nTECHNICAL SKILLS\nFrontend Development React.js | HTML | CSS | JavaScript | TypeScript | Tailwind CSS | Framer Motion | Vite\nBackend Development Node.js | Express.js | Python | Flask\nDatabase & Storage MongoDB | Redis | Database Optimization\nDevelopment Tools Git | GitHub | Vercel | Railway | CI/CD\nAPI Development RESTful APIs | GraphQL | API Integration\nPerformance & Optimization Caching | Database Optimization | Performance Monitoring\nAI & Generative Technologies: Retrieval-Augmented Generation (RAG) | LangChain | LlamaIndex | Vector\nDatabases (FAISS) | Large Language Models (LLMs) | Prompt Engineering | Hugging Face | OpenAI API |\nAgentic AI Basics\nADDITIONAL INFORMATION\nExperienced in building scalable web applications with modern technologies\nStrong understanding of full-stack development and system architecture\nPassionate about AI integration and intelligent user experiences\nProven track record of delivering high-quality projects on time\nExcellent problem-solving skills and attention to detail\nStrong communication skills and ability to work in team environments\nCommitted to continuous learning and staying updated with latest technologies\nCERTIFICATIONS Fundamentals of Agents - HuggingFace\nLanguages English, Hindi, Marathi\nLAA - Luxury Audit & Assurance Platform\n Tech Stack: React, Node.js, MongoDB, Express, Tailwind CSS\n Developed a comprehensive luxury hospitality audit and assurance platform\n Built service assessment tools and training academy for hotels and restaurants\n Implemented user management system and reporting dashboard\nCreated responsive design for various hospitality industry needs\nRAG-Based Document Query System\nTech Stack: Python, LangChain, OpenAI API, FAISS, Flask, React, MongoDB\nDesigned and implemented a Retrieval-Augmented Generation (RAG) system for intelligent document querying.\nUtilized LangChain and FAISS vector database to embed and retrieve relevant document chunks for precise context-based\nanswers.\nIntegrated Groq AI’s LLM API to generate accurate, grounded responses from custom data sources.\nReact frontend interface for seamless user interaction.\nOptimized embedding storage and retrieval speed, improving query response accuracy and latency.\nAI Chat PPT – AI-Powered PowerPoint Generator\nTech Stack: React,  React, TypeScript, Google Gemini API, pptxgenjs, Vercel.\nBuilt  an  AI-powered  chat  application  that  generates  and  edits  professional  PowerPoint  presentations  using  natural\nlanguage prompts.\nImplemented real-time slide editing with instant preview, template styling, and thumbnail navigation.\nIntegrated 9+ professional presentation templates, including Tech, Executive, Creative, and Minimalist styles.\nDeveloped a responsive interface with chat-based interaction, file upload support, and persistent chat history.\nAdded PowerPoint export functionality using pptxgenjs with optimized 16:9 layout and consistent design.\nDeployed on Vercel with environment-based Gemini API integration.",
  "openai": {
    "experience": [
      {
        "jobTitle": "Software Developer",
        "company": "TrioNxt Software Private Ltd",
        "duration": "Dec 2023 - Feb 2025",
        "startDate": "2023-12",
        "endDate": "2025-02",
        "techUsed": [
          "Angular",
          "Database Management"
        ],
        "description": "Primary focus is on utilizing Angular framework. Contribute to developing and maintaining robust. Design and implement efficient back-end architectures, manage databases, and ensure seamless integration with front-end components. Contributed to parallel design sessions, creating design artifacts based on project specifications, and ensured that all components of the web application were platform and browser compatible.",
        "achievements": []
      }
    ]
  },
  "gemini": {
    "experience": []
  },
  "analysis": {
    "openaiExpCount": 1,
    "geminiExpCount": 0,
    "openaiHasDates": true,
    "geminiHasDates": false
  }
}